<?php

class Translite {

	/**
     * Транслит текста
     * Переводит кириллицу в латиницу
	 * @param string $title строка
     * @return string
     */
	function translite_text ($title) {
		$array = [
			'А' => 'a',     'а' => 'a', 
			'Б' => 'b',     'б' => 'b', 
			'В' => 'v',     'в' => 'v', 
			'Г' => 'g',     'г' => 'g', 
			'Д' => 'd',     'д' => 'd', 
			'Е' => 'e',     'е' => 'e', 
			'Ё' => 'yo',    'ё' => 'yo', 
			'Ж' => 'zh',    'ж' => 'zh',
			'З' => 'z',     'з' => 'z', 
			'И' => 'i',     'и' => 'i', 
			'Й' => 'j',     'й' => 'j', 
			'К' => 'k',     'к' => 'k', 
			'Л' => 'l',     'л' => 'l', 
			'М' => 'm',     'м' => 'm', 
			'Н' => 'n',     'н' => 'n', 
			'О' => 'o',     'о' => 'o', 
			'П' => 'p',     'п' => 'p', 
			'Р' => 'r',     'р' => 'r', 
			'С' => 's',     'с' => 's', 
			'Т' => 't',     'т' => 't', 
			'У' => 'u',     'у' => 'u', 
			'Ф' => 'f',     'ф' => 'f', 
			'Х' => 'kh',    'х' => 'kh', 
			'Ц' => 'c',     'ц' => 'c', 
			'Ч' => 'ch',    'ч' => 'ch', 
			'Ш' => 'sh',    'ш' => 'sh', 
			'Щ' => 'shh',   'щ' => 'shh', 
			'Ъ' => '',      'ъ' => '', 
			'Ы' => 'y',     'ы' => 'y', 
			'Ь' => '',      'ь' => '', 
			'Э' => 'e',     'э' => 'e', 
			'Ю' => 'yu',    'ю' => 'yu', 
			'Я' => 'ya',    'я' => 'ya', 
			' ' => '-',
		];
		
		$key 			= array_keys ($array);
		$value 			= array_values ($array);
		$url_translite 	= str_replace ($key, $value, $title); 
		return preg_replace ("/[^a-z0-9-]/i", "", $url_translite); 
	}
}
